Ran Apply for project: `gitea` dir: `apps/gitea` workspace: `gitea`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform1.2.9 apply -input=false -no-color" in "/atlantis-data/repos/mvaldes14/terraform/16/gitea/apps/gitea": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/elxilote/gitea/runs/run-FN9q1EyJNN6wbij5

Waiting for the plan to start...

Terraform v1.5.7
on linux_amd64
Initializing plugins and modules...
gitea_repository.this["api-go-templ"]: Refreshing state... [id=20]
gitea_repository.this["meal-notifier"]: Refreshing state... [id=19]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # gitea_repository.this["flux-test"] will be created
  + resource "gitea_repository" "this" {
      + allow_manual_merge          = true
      + allow_merge_commits         = true
      + allow_rebase                = true
      + allow_rebase_explicit       = true
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + autodetect_manual_merge     = true
      + clone_url                   = (known after apply)
      + created                     = (known after apply)
      + default_branch              = "main"
      + gitignores                  = "Go"
      + has_issues                  = true
      + has_projects                = true
      + has_pull_requests           = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + id                          = (known after apply)
      + ignore_whitespace_conflicts = true
      + issue_labels                = "Default"
      + migration_issue_labels      = true
      + migration_milestones        = true
      + migration_mirror_interval   = "8h0m0s"
      + migration_releases          = true
      + mirror                      = false
      + name                        = "flux-test"
      + permission_admin            = (known after apply)
      + permission_pull             = (known after apply)
      + permission_push             = (known after apply)
      + private                     = false
      + repo_template               = false
      + ssh_url                     = (known after apply)
      + updated                     = (known after apply)
      + username                    = "mvaldes"
    }

Plan: 1 to add, 0 to change, 0 to destroy.


Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>